#Джеси решава, че иска да се занимава с баскетбол, но за да тренира е нужна екипировка.
#Напишете програма, която изчислява какви разходи ще има Джеси,
#ако започне да тренира, като знаете колко е таксата за тренировки по баскетбол за период от 1 година.
#Нужна екипировка:

#• Баскетболни кецове – цената им е 40% по-малка от таксата за една година

#• Баскетболен екип – цената му е 20% по-евтина от тази на кецовете

#• Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип

#• Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка
# вход 365
#изход 811.76

fee = int(input())
sneakers =fee -  (fee * 0.40)
sportswear = sneakers - (sneakers * 0.20)
ball = sportswear / 4
accessoar = ball  / 5

total_sum = sneakers + sportswear + ball + accessoar + fee 
print(total_sum)