#Дадено е цяло число – начален брой точки. Върху него се начисляват бонус точки по правилата, описани по-долу.
# Да се напише програма, която пресмята бонус точките, които получава числото и общия брой точки (числото + бонуса).

# Ако числото е до 100 включително, бонус точките са 5;

# Ако числото е по-голямо от 100, бонус точките са 20% от числото;

# Ако числото е по-голямо от 1000, бонус точките са 10% от числото.

# Допълнителни бонус точки (начисляват се отделно от предходните):

# За четно число à + 1 т.

# За число, което завършва на 5 à +
# Вход 20 Изход 6 и 26

num = int(input())
bonus = 0

if num <= 100:
    bonus = 5
elif num <= 1000:
    bonus = num * 0.20
else:
    bonus = num * 0.10

if num % 2 == 0:
    bonus = bonus + 1
elif num % 10 == 5:
    bonus = bonus + 2

total_points = bonus + num

print(bonus)
print(total_points)