#Ресторант отваря врати и предлага няколко менюта на преференциални цени:

#• Пилешко меню – 10.35 лв.

#• Меню с риба – 12.40 лв.

#• Вегетарианско меню – 8.15 лв.

#Напишете програма, която изчислява колко ще струва на група хора да си поръчат храна за вкъщи.
#Групата ще си поръча и десерт, чиято цена е равна на 20% от общата сметка (без доставката).
#Цената на доставка е 2.50 лв и се начислява най-накрая.

#Вход
#От конзолата се четат 3 реда: 2 4 3

#Изход 116.2
#Да се отпечата на конзолата един ред: "{цена на поръчката}"

chicken_menu = float(input())
fish_menu = float(input())
vegan_menu = float(input())

price_chicken = chicken_menu * 10.35
price_fish = fish_menu * 12.40
price_vegan = vegan_menu * 8.15
big_menu = price_vegan + price_chicken + price_fish 
desert = big_menu * 0.2
result = big_menu + desert + 2.5
print(result)
