# Деси трябва да заведе котката си на ветеринар, но паркингът се заплаща.
# Напишете програма, която пресмята колко общо трябва да се плати за престоя на колата на Деси на паркинга.
# Паркингът е различен от останалите и има разнообразен ценоразпис.
# За всеки четен ден и нечетен час, паркингът таксува 2.50 лева.
# Във всеки нечетен ден и четен час таксата е 1.25 лева, във всички останали случаи се заплаща 1 лев.
# Таксуването става на всеки изминал час от деня.
# Всеки един от изходите трябва да бъде закръглен до втория знак след десетичната запетая.
# Вход

# От конзолата се четaт два реда:
# · Брой дни – цяло число в интервала [1 … 5]
# · Брой часове за всеки един от дните - цяло число в интервала [1 … 24]
# Изход:
# Да се отпечата на конзолата:
# · За всеки изминал ден, общата сума, която трябва да се плати:
# "Day: {индексът на деня} – {общата сума за деня} leva"
# · Когато програмата приключи:
# "Total: {общата сума за всички дни} leva"

number_of_days = int(input())
number_of_hours = int(input())
total_costs = 0

for day in range(1, number_of_days + 1):
    current_costs = 0
    
    for hour in range(1, number_of_hours + 1):
        if day % 2 == 0 and hour % 2 != 0:
            current_costs += 2.5
            total_costs += 2.5
        elif day % 2 != 0 and hour % 2== 0:
              current_costs += 1.25
              total_costs += 1.25
        elif day % 2 != 0 and hour % 2 == 0:
            current_costs += 1
            total_costs =+ 1
        else:
            current_costs += 1
            total_costs += 1
            
    print(f"Day: {day} - {current_costs:.2f} leva")
    
print(f"Total: {total_costs:.2f} leva")