# Световен рекорд по плуване

# Иван решава да подобри Световния рекорд по плуване на дълги разстояния.
# На конзолата се въвежда рекордът в секунди, който Иван трябва да подобри, разстоянието в метри,
# което трябва да преплува и времето в секунди, за което плува разстояние от 1 м.
# Да се напише програма, която изчислява дали се е справил със задачата, като се има предвид, че:
# съпротивлението на водата го забавя на всеки 15 м. с 12.5 секунди.
# Когато се изчислява колко пъти Иван ще се забави, в резултат на съпротивлението на водата,
# резултатът трябва да се закръгли надолу до най-близкото цяло число.
# Да се изчисли времето в секунди, за което Иван ще преплува разстоянието и разликата спрямо Световния рекорд.
# Вход 10464 1500 20 и 55555.67 3017 5.03
# От конзолата се четат 3 реда:
# 1. Рекордът в секунди – реално число;
# 2. Разстоянието в метри – реално число;
# 3. Времето в секунди, за което плува разстояние от 1 м. - реално число.
# Изход No, he failed! He was 20786.00 seconds slower и Yes, he succeeded! The new world record is 17688.01 seconds.



record_second = float(input())
distance = float(input())
time_sec_one_meter = float(input())

total_time = distance * time_sec_one_meter

delay = distance // 15 * 12.5
total_time = total_time  + delay

if total_time < record_second:
    print(f"Yes, he succeeded! The new world record is {total_time:.2f} seconds.")
else:
    diff = total_time - record_second
    print(f"No, he failed! He was {diff:.2f} seconds slower.")